hr/app/Helpers/Helpers.php

    function app_setting()
    {
        $appSetting = Cache::remember('appSetting', 3600, function () {
            return Application::with('currency')->first();
---
select * from `applications` limit 1
select * from `currencies` where `currencies`.`id` in (1)