hr/modules/HumanResource/DataTables/EmployeeDataTable.php

select * from `positions` where `positions`.`id` = 3 and `positions`.`deleted_at` is null order by `id` desc limit 1
---
    public function dataTable(QueryBuilder $query): EloquentDataTable
    {
        return (new EloquentDataTable($query))
            ->addIndexColumn()

            ->editColumn('employee_id', function ($employee) {
                return $employee->employee_id;
            })
            ->editColumn('full_name', function ($employee) {
                return ucwords($employee->full_name);
            })
            ->filterColumn('full_name', function ($query, $keyword) {
                $query->where('first_name', 'like', "%{$keyword}%")
                    ->orWhere('last_name', 'like', "%{$keyword}%")
                    ->orWhere('middle_name', 'like', "%{$keyword}%");
            })
            ->editColumn('position_id', function ($employee) {
                return ucwords($employee->position ? $employee->position->position_name : '');
            })
            ->filterColumn('position_id', function ($query, $keyword) {
                $query->whereHas('position', function ($query) use ($keyword) {
                    $query->where('position_name', 'like', "%{$keyword}%");
                });
            })
            ->addColumn('status', function ($employee) {
                $status = '';

                if ($employee->is_active == 1) {
                    $status .= '<span class="badge badge-success-soft">' . localize('active') . '</span>';
                } else {
                    $status .= '<span class="badge badge-danger-soft">' . localize('inactive') . '</span>';
                }
                return $status;
            })

select * from `doc_expired_settings` limit 1
---
                $hasSecondary = false;
                $hasYellow = false;

                $doc_expiry_day_setup = DocExpiredSetting::first();