hr/modules/HumanResource/DataTables/StaffAttendanceDataTable.php

select * from `departments` where `departments`.`id` = 3 and `departments`.`deleted_at` is null order by `id` desc limit 1
select * from `positions` where `positions`.`id` = 1 and `positions`.`deleted_at` is null order by `id` desc limit 1
---
    public function dataTable(QueryBuilder $query): EloquentDataTable
    {
        $query = (new EloquentDataTable($query))

            ->addIndexColumn()

            ->addColumn('staff_name', function ($row) {
                return '<a href="' . route('reports.staff-attendance-detail', $row->id) . '">' . $row->full_name . '</a>';
            })
            ->filterColumn('staff_name', function ($query, $keyword) {
                $query->where('full_name', 'like', "%{$keyword}%");
            })

            ->editColumn('employee_id', function ($row) {
                return $row->employee_id;
            })
            ->filterColumn('employee_id', function ($query, $keyword) {
                $query->where('employee_id', 'like', "%{$keyword}%");
            })

            ->addColumn('department', function ($row) {
                return $row->department?->department_name;
            })
            ->filterColumn('department', function ($query, $keyword) {
                $query->whereHas('department', function ($query) use ($keyword) {
                    $query->where('department_name', 'like', "%{$keyword}%");
                });
            })

            ->addColumn('position', function ($row) {
                return $row->position?->position_name;
            })
            ->filterColumn('position', function ($query, $keyword) {
                $query->whereHas('position', function ($query) use ($keyword) {
                    $query->where('position_name', 'like', "%{$keyword}%");
                });
            })