hr/app/Http/Controllers/BotManController.php

select * from `employees` where `user_id` = 28 and `employees`.`deleted_at` is null limit 1
---
    protected function showUserDetails($bot, $userId)
    {
        $employee = Employee::where('user_id', $userId)->first();

select * from `attendances` where `employee_id` = 28 order by `time` desc limit 5
---
    protected function showAttendance($bot, $userId)
    {
        // Fetch attendance records from your database
        $attendance = DB::table('attendances') // Adjust table name as per your schema
            ->where('employee_id', $userId)
            ->orderBy('time', 'desc')
            ->limit(5)
            ->get();