hr/app/Http/Controllers/HomeController.php

select count(*) as aggregate from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `employees` where `employees`.`department_id` in (1, 2, 3, 4) and `employees`.`deleted_at` is null
select `id`, `department_name` from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select `id`, `employee_id`, `time` from `attendances` where `attendances`.`employee_id` in (7, 8, 9, 10, 11, 12, 13) and `attendances`.`deleted_at` is null
select * from `apply_leaves` where `apply_leaves`.`deleted_at` is null order by `created_at` desc, `id` desc limit 4
select `id`, `employee_id`, `first_name`, `middle_name`, `last_name`, `email`, `position_id`, `department_id` from `employees` where `employees`.`id` in (11, 21) and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (2) and `positions`.`deleted_at` is null order by `id` desc
---
    public function index()
    {
        $total_employee   = Employee::where('is_active', 1)->count();
        $present_employee = $this->count_attend_employee();
        $today_leave      = $this->leave_employee()->leave_total;

        $departments = Department::with([
            'employees.attendances:id,employee_id,time',
            'employees.leave:id,employee_id,leave_apply_start_date,leave_apply_end_date,leave_approved_start_date,leave_approved_end_date,is_approved_by_manager,is_approved',
        ])->whereNull('parent_id')
            ->where('is_active', true)
            ->get(['id', 'department_name']);

        // department wise employee attendances
        $departmentWiseAttendanceReport = $this->attendanceDepartmentWise(0);

        // position wise candidate count

        // leave appropriated employee
        $leaveEmployees = ApplyLeave::with([
            'employee:id,employee_id,first_name,middle_name,last_name,email,position_id,department_id',
            'employee.position:id,position_name'
        ])
            ->latest()
            ->take(4)
            ->get();

select * from `employees` where `user_id` = 28 and `employees`.`deleted_at` is null limit 1
select * from `point_settings` where `point_settings`.`deleted_at` is null order by `id` desc limit 1
select count(*) as aggregate from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
---
    public function myProfile()
    {
        $userId = Auth::id();

        $userInfo = Auth::user();
        if ($userInfo->user_type_id == 1) {
            return redirect()->route('empProfile');
        }
        $employee_info = Employee::where('user_id', $userId)
            ->first();

        $point_settings     = PointSettings::first();
        $total_employee     = Employee::where('is_active', 1)->count();

select * from `holidays` where year(`start_date`) = '2024' and `holidays`.`deleted_at` is null order by `start_date` desc, `id` desc
---
    public function get_holidays_current_year()
    {
        $year = date('Y');

        // leave applications
        $holidays = Holiday::select('*')
            ->whereYear('start_date', $year)
            ->orderBy('start_date', 'desc')
            ->get();

select * from `apply_leaves` where `employee_id` = 11 and `apply_leaves`.`deleted_at` is null order by `created_at` desc, `id` desc limit 3
select `id`, `employee_id`, `first_name`, `middle_name`, `last_name`, `email`, `position_id`, `department_id` from `employees` where `employees`.`id` in (11) and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (2) and `positions`.`deleted_at` is null order by `id` desc
---
    public function get_leave_applications($employee_id)
    {
        $year = date('Y');

        // leave applications
        $leaveApplications = ApplyLeave::with([
            'employee:id,employee_id,first_name,middle_name,last_name,email,position_id,department_id',
            'employee.position:id,position_name'
        ])
            ->where('employee_id', $employee_id)
            ->latest()
            ->take(3)
            ->get();

select * from `week_holidays` limit 1
select `holidays`.*, SUM(total_day) as total_day_sum from `holidays` where `holidays`.`start_date` >= '2024-01-01 00:00:00' and `holidays`.`end_date` <= '2024-12-07' and `holidays`.`deleted_at` is null limit 1
---
    public function totalWorkingDays($year, $employee_id)
    {
        $betweendate = $this->betweenDate();

        //Calculate monthly working days for the employee
        $all_weekends = WeekHoliday::first();
        $weekends_days = explode(',', @$all_weekends->dayname);

        $weekends = array();
        $validDays = ["Saturday", "Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday"];

        foreach ($weekends_days as $value) {
            if (in_array(ucwords($value), $validDays)) {
                $weekends[] = ucwords($value);
            }
        }

        $holidaysWithSum = DB::table('holidays')
            ->select('holidays.*', DB::raw('SUM(total_day) as total_day_sum'))
            ->where('holidays.start_date', '>=', $betweendate['start_date'])
            ->where('holidays.end_date', '<=', $betweendate['end_date'])
            ->whereNull('holidays.deleted_at')
            ->first();

select `apply_leaves`.*, SUM(total_approved_day) as total_day_sum from `apply_leaves` where `apply_leaves`.`leave_approved_start_date` >= '2024-01-01 00:00:00' and `apply_leaves`.`leave_approved_end_date` <= '2024-12-07' and `apply_leaves`.`is_approved_by_manager` = 1 and `apply_leaves`.`is_approved` = 1 and `apply_leaves`.`employee_id` = 11 and `apply_leaves`.`deleted_at` is null limit 1
---
        );

        //total leave calculation start
        $getLeaveInfo =  DB::table('apply_leaves')
            ->select('apply_leaves.*', DB::raw('SUM(total_approved_day) as total_day_sum'))
            ->where('apply_leaves.leave_approved_start_date', '>=', $betweendate['start_date'])
            ->where('apply_leaves.leave_approved_end_date', '<=', $betweendate['end_date'])
            ->where('apply_leaves.is_approved_by_manager', 1)
            ->where('apply_leaves.is_approved', 1)
            ->where('apply_leaves.employee_id', $employee_id)
            ->whereNull('apply_leaves.deleted_at')
            ->first();

select DATE(time) as date, `employee_id`, MIN(time) as first_time, COUNT(*) as attendance_count from `attendances` where `employee_id` = 11 and year(`time`) = '2024' and `deleted_at` is null group by DATE(time)
---
    public function count_attend_employee_current_year($employee_id)
    {
        $year = date('Y');

        $result = DB::table('attendances')
            ->select(
                DB::raw('DATE(time) as date'),
                'employee_id',
                DB::raw('MIN(time) as first_time'),
                DB::raw('COUNT(*) as attendance_count')
            )
            ->where('employee_id', $employee_id)
            ->whereYear('time', $year)
            ->whereNull('deleted_at')
            ->groupBy(DB::raw('DATE(time)'))
            ->get();

select COUNT(*) from `attendances` where date(`time`) = '2024-12-07' and `deleted_at` is null group by `employee_id`
---
    public function count_attend_employee()
    {
        $date = date('Y-m-d');
        $result = DB::table('attendances')
            ->select(DB::raw('COUNT(*)'))
            ->whereDate('time', $date)
            ->whereNull('deleted_at') // Check if deleted_at is NULL
            ->groupBy('employee_id')
            ->get();

select COUNT(employee_id) as leave_total from `apply_leaves` where date(`leave_approved_start_date`) <= '2024-12-07' and date(`leave_approved_end_date`) >= '2024-12-07' and `deleted_at` is null
---
    public function leave_employee()
    {
        $date  = date('Y-m-d');

        $result = DB::table('apply_leaves')
            ->select(DB::raw('COUNT(employee_id) as leave_total'))
            ->whereDate('leave_approved_start_date', '<=', $date)
            ->whereDate('leave_approved_end_date', '>=', $date)
            ->whereNull('deleted_at') // Check if deleted_at is NULL
            ->get();

select * from `employees` where `employees`.`department_id` in (1, 2, 3, 4) and `employees`.`deleted_at` is null
select `id`, `department_name` from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select `id`, `employee_id`, `time` from `attendances` where `attendances`.`employee_id` in (7, 8, 9, 10, 11, 12, 13) and `attendances`.`deleted_at` is null
---
    public function attendanceDepartmentWise($type)
    {
        $type = request()->get('type') ?? $type;
        switch ($type) {
            case 0:
                $fromDate = Carbon::now()->startOfDay();
                $toDate = Carbon::now()->endOfDay();
                break;

            case 1:
                $fromDate = Carbon::now()->startOfWeek();
                $toDate = Carbon::now()->endOfWeek();
                break;

            case 2:
                $fromDate = Carbon::now()->startOfMonth();
                $toDate = Carbon::now()->endOfMonth();
                break;

            case 3:
                $fromDate = Carbon::now()->startOfYear();
                $toDate = Carbon::now()->endOfYear();
                break;

            default:
                $fromDate = Carbon::now()->startOfDay();
                $toDate = Carbon::now()->endOfDay();
                break;
        }

        $departments = Department::with([
            'employees.attendances:id,employee_id,time',
            'employees.leave:id,employee_id,leave_apply_start_date,leave_apply_end_date,leave_approved_start_date,leave_approved_end_date,is_approved_by_manager,is_approved',
        ])
            ->whereNull('parent_id')
            ->where('is_active', true)
            ->get(['id', 'department_name']);

select DATE(time) as date from `attendances` where `attendances`.`employee_id` = 8 and `attendances`.`employee_id` is not null and `time` between '2024-12-07 00:00:00' and '2024-12-07 23:59:59' and `attendances`.`deleted_at` is null group by `date`
---
            $presentCount = 0;
            $leaveCount = 0;
            foreach ($department->employees as $employee) {
                $presentCount += $employee->attendances()
                    ->selectRaw('DATE(time) as date')
                    ->whereBetween('time', [$fromDate, $toDate])
                    ->groupBy('date')
                    ->get()
                    ->count();