hr/modules/HumanResource/Http/Controllers/DepartmentController.php

    public function index(DepartmentDataTable $dataTable)
    {
        $departments = Department::whereNull('parent_id')->paginate(5);
        $sub_departments = Department::whereNotNull('parent_id')->get();
---
select * from `departments` where `parent_id` is null and `departments`.`deleted_at` is null order by `id` desc limit 5 offset 0
select count(*) as aggregate from `departments` where `parent_id` is null and `departments`.`deleted_at` is null
select * from `departments` where `parent_id` is not null and `departments`.`deleted_at` is null order by `id` desc

    public function edit($id)
    {
        $department = Department::where('uuid', $id)->firstOrFail();
---
select * from `departments` where `uuid` = 'f6c34a4d-8f36-4292-89f7-218b6cf4cfef' and `departments`.`deleted_at` is null order by `id` desc limit 1

    public function getEmployees(Request $request)
    {
        $department = Department::findOrFail($request->id);
        $employees = Employee::where('department_id', $department->id)
            ->where('is_active', true)
            ->get(['id', 'first_name', 'last_name', 'middle_name']);
---
select * from `departments` where `departments`.`id` = '3' and `departments`.`deleted_at` is null order by `id` desc limit 1
select `id`, `first_name`, `last_name`, `middle_name` from `employees` where `department_id` = 3 and `is_active` = 1 and `employees`.`deleted_at` is null