hr/modules/HumanResource/Http/Controllers/LeaveController.php

select * from `week_holidays`
---
    public function weekleave()
    {
        $dbData = WeekHoliday::all();

select * from `leave_types` where `leave_types`.`deleted_at` is null order by `id` desc
---
    public function leaveTypeindex()
    {
        $dbData = LeaveType::all();

select * from `leave_types` where `leave_types`.`deleted_at` is null order by `id` desc
select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
---
    public function index(LeaveApplicationDataTable $dataTable)
    {
        $leaveTypes = LeaveType::all();
        $employees = Employee::where('is_active', 1)->get();

select * from `apply_leaves` where `is_approved_by_manager` = 0 and `apply_leaves`.`deleted_at` is null order by `id` desc limit 30 offset 0
select count(*) as aggregate from `apply_leaves` where `is_approved_by_manager` = 0 and `apply_leaves`.`deleted_at` is null
---
    public function leaveApproval()
    {
        $leaves = ApplyLeave::where('is_approved_by_manager', false)->paginate(30);