hr/modules/HumanResource/Http/Controllers/ManualAttendanceController.php

select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
---
    public function create()
    {
        $employee = Employee::where('is_active', 1)->get();

select `id`, `first_name`, `middle_name`, `last_name`, `position_id`, `employee_id` from `employees` where not exists (select * from `attendances` where `employees`.`id` = `attendances`.`employee_id` and date(`time`) = '2024-12-12' and `attendances`.`deleted_at` is null) and `is_active` = 1 and `employees`.`deleted_at` is null
select `id`, `position_name` from `positions` where `positions`.`id` in (1, 2, 3) and `positions`.`deleted_at` is null order by `id` desc
---
    public function missingAttendance(Request $request)
    {
        $date = $request->date;
        // if date is not set then set current date
        if (!$date) {
            $date = Carbon::now()->format('Y-m-d');
        } else {
            $date = Carbon::parse($date)->format('Y-m-d');
        }
        $missingAttendance = Employee::with(['position:id,position_name'])->doesntHave('attendances', 'and', function ($query) use ($date) {
            $query->whereDate('time', $date);
        })->where('is_active', true)->get(['id', 'first_name', 'middle_name', 'last_name', 'position_id', 'employee_id']);

insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values ('7', '2024-12-12 20:52:00', '2024-12-07 17:53:10', '2024-12-07 17:53:10')
insert into `attendances` (`employee_id`, `time`, `updated_at`, `created_at`) values ('7', '2024-12-12 21:53:00', '2024-12-07 17:53:10', '2024-12-07 17:53:10')
---
    public function missingAttendanceStore(Request $request)
    {
        $request->validate([
            'employee_id' => 'required|array',
            'employee_id.*' => 'required|integer',
            'in_time' => 'required|array',
            'in_time.*' => 'required|date_format:H:i',
            'out_time' => 'required|array',
            'out_time.*' => 'required|date_format:H:i',
            'date' => 'required|date',
        ]);
        try {
            DB::beginTransaction();
            $in_time = $request->in_time;
            $out_time = $request->out_time;
            $employee_id = $request->employee_id;
            $date = Carbon::parse($request->date);

            foreach ($employee_id as $key => $value) {
                $inDateTime = $date->copy()->modify($in_time[$key]);
                $outDateTime = $date->copy()->modify($out_time[$key]);

                Attendance::create([
                    'employee_id' => $value,
                    'time' => $inDateTime,
                ]);
                Attendance::create([
                    'employee_id' => $value,
                    'time' => $outDateTime,
                ]);