hr/modules/HumanResource/Http/Controllers/PositionController.php

select * from `positions` where `positions`.`deleted_at` is null order by `id` desc
---
    public function index()
    {
        return view('humanresource::employee.position.index', [
            'positions' => Position::all()
        ]);