hr/modules/HumanResource/Http/Controllers/ReportController.php

select * from `departments` where `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
---
    public function staffAttendanceReport(StaffAttendanceDataTable $dataTable)
    {

        return $dataTable->render('humanresource::reports.staff-attendance', [
            'departments' => Department::where('is_active', true)->get(),
            'positions' => Position::where('is_active', true)->get(),
        ]);

select * from `departments` where `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select `id`, `first_name`, `last_name`, `middle_name` from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `leave_types` where `leave_types`.`deleted_at` is null order by `id` desc
---
    public function leaveReport(Request $request, LeaveReportDataTable $dataTable)
    {
        return $dataTable->render('humanresource::reports.leave', [
            'departments' => Department::where('is_active', true)->get(),
            'employees' => Employee::where('is_active', true)->get(['id', 'first_name', 'last_name', 'middle_name']),
            'leave_types' => LeaveType::all(),
        ]);

select * from `departments` where `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
---
    public function dailyPresentReport(DailyPresentReportDataTable $dataTable)
    {
        $departments = Department::where('is_active', true)->get();

select * from `departments` where `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
---
    public function monthlyReport()
    {
        $departments = Department::where('is_active', true)->get();

select * from `week_holidays` limit 1
select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select employee_id, DATE(time) as date, COUNT(time) as count, MIN(time) as in_time, MAX(time) as out_time from `attendances` where exists (select * from `employees` where `attendances`.`employee_id` = `employees`.`id` and `department_id` = '3' and `employees`.`deleted_at` is null) and `employee_id` = '11' and date(`time`) >= '2023-03-01' and date(`time`) <= '2023-03-31' and `attendances`.`deleted_at` is null group by `employee_id`, `date` order by `date` asc
---
    public function monthlyReportShow(Request $request)
    {
        $employee_id = $request->employee_id;
        $department_id = $request->department_id;
        $month = $request->month;
        $year = $request->year;

        $start_date = Carbon::parse($year . '-' . $month . '-01')->format('Y-m-d');
        $end_date = Carbon::parse($year . '-' . $month . '-01')->endOfMonth()->format('Y-m-d');

        $collection = new Collection();

        $weekend = WeekHoliday::first();
        $weekends_array = explode(',', $weekend->dayname);

        $weekends = array_map(function ($weekend) {
            return ucfirst($weekend);
        }, $weekends_array);

        $employees = Employee::where('is_active', true)->get();

        $attendances = Attendance::selectRaw('employee_id, DATE(time) as date, COUNT(time) as count, MIN(time) as in_time, MAX(time) as out_time')
            ->with(
                [
                    'employee:id,first_name,last_name,middle_name,department_id,employee_id',
                    'employee.department:id,department_name'
                ]
            )
            ->when($department_id > 0, function ($query) use ($department_id) {
                $query->whereHas('employee', function ($q) use ($department_id) {
                    $q->where('department_id', $department_id);
                });
            })
            ->when($employee_id > 0, function ($query) use ($employee_id) {
                $query->where('employee_id', $employee_id);
            })
            ->whereDate('time', '>=', $start_date)
            ->whereDate('time', '<=', $end_date)
            ->groupBy('employee_id', 'date')
            ->orderBy('date', 'asc')
            ->get();

select * from `holidays` where date(`start_date`) <= '2023-03-01' and date(`end_date`) >= '2023-03-01' and `holidays`.`deleted_at` is null order by `id` desc
---
                    ]);
                }
            } else {
                $holidays = Holiday::whereDate('start_date', '<=', $start_date)
                    ->whereDate('end_date', '>=', $start_date)->get()->toArray();

select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
---
    public function employeeReport(EmployeeReportDataTable $dataTable)
    {
        return $dataTable->render('humanresource::reports.employee-report', [
            'employees' => Employee::where('is_active', true)->get(),
            'positions' => Position::where('is_active', true)->get(),
        ]);